haodoan/GPS_Tracking_STM32/FreeRTOS/Demo/Source/sim908.c
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "FreeRTOS.h"
#include "queue.h"
#include "semphr.h"

/* Library includes. */
#include "stm32f10x_lib.h"

/* Demo application includes. */
#include "serial.h"

/* Demo application includes. */
#include "sim908.h"

extern uart_rtos_handle_t uart2_handle;
SemaphoreHandle_t xMutex;
/*Get response from SIMCOM after send AT command*/
uint8_t GetResponse(char *buff_receive, uint32_t timeout)
{
    uint8_t count_char = 0;
    TickType_t xtime;
    signed char SIM_RxChar;
    char cPassMessage[MAX_LENGH_STR];

    xtime = xTaskGetTickCount();

    do
    {
        if (pdFALSE != xSerialGetChar(&uart2_handle, &SIM_RxChar, 20))
        {
            cPassMessage[count_char++] = SIM_RxChar;
        }
        else
        {
            if((SIM_RxChar == 0xA) && (cPassMessage[count_char -2] == 0xD) && (count_char > 4))
            {
                break;
            }
        }
    } while ((xTaskGetTickCount() - xtime < timeout )&&(count_char < MAX_LENGH_STR));

    if (count_char == MAX_LENGH_STR)
    {
        return pdFALSE;
    }
    cPassMessage[count_char] = '\0';
    strcpy(buff_receive, cPassMessage);

    return pdTRUE;
}

int8_t SendATcommand2(char *ATcommand,char *expected_answer,char *expected_answer2, unsigned int timeout)
{
    char buffer_response[MAX_LENGH_STR];
    signed char SIM_RxChar;
    uint32_t error = pdTRUE;

    if( xSemaphoreTake( xMutex, ( TickType_t ) portMAX_DELAY ) == pdTRUE )
    {
        while(pdTRUE == xSerialGetChar(&uart2_handle, &SIM_RxChar,100));
        printf("%s\r", ATcommand); // Send the AT command
        if (pdFALSE == GetResponse(buffer_response, timeout))
        {
            error = pdFALSE;
        }
        else
        {
            if (strstr(buffer_response, expected_answer))
            {
                GetResponse(buffer_response, timeout);
                if (strstr(buffer_response, expected_answer2) == NULL)
                {
                    error = pdFALSE;
                }
            }        
        }
        xSemaphoreGive( xMutex );        
    }
       
    return error;
}

int8_t SendATcommand(char *ATcommand, char *expected_answer,unsigned int timeout)
{
    uint8_t count_char = 0;
    uint8_t error = pdTRUE;
    signed char SIM_RxChar;
    char cPassMessage[MAX_LENGH_STR];

    memset(cPassMessage,'\0',MAX_LENGH_STR);
    if( xSemaphoreTake( xMutex, ( TickType_t ) portMAX_DELAY ) == pdTRUE )
    {
        while(pdTRUE == xSerialGetChar(&uart2_handle, &SIM_RxChar,200));
        printf("%s\r", ATcommand); // Send the AT command
        do
        {
            if (pdFALSE != xSerialGetChar(&uart2_handle, &SIM_RxChar,timeout))
            {
                cPassMessage[count_char++] = SIM_RxChar;
            }
            else
            {
                error = pdFAIL;
                break;
            }
            if(strstr(cPassMessage,expected_answer))
            {
                break;
            }
            if(strstr(cPassMessage,"+HTTPACTION:1,400"))
            {
                error = pdFAIL;
                break;
            }            
        } while (count_char < MAX_LENGH_STR);

        if ((count_char == MAX_LENGH_STR) || (error == pdFAIL))
        {
            xSemaphoreGive( xMutex );
            return pdFALSE;
        }
        cPassMessage[count_char] = '\0';
        xSemaphoreGive( xMutex );
				
		return pdTRUE;
    }
		else
			return pdFALSE;
}

uint8_t GPS_PWR()
{
   // Power up GPS
     SendATcommand("AT+CGPSPWR=1", "OK", 2000);
    // Reset GPS Hot bmode
     SendATcommand("AT+CGPSRST=1", "OK", 2000);
     return pdTRUE;
}
/*FUNCTION**********************************************************************
 *
 * Function Name : start_GPS
 * Description   : Starting GPS for modul SIM908
 * This function
 *
 *END**************************************************************************/
BaseType_t Wait_GPS_Fix(void)
{
    // waits for fix GPS
    if(pdTRUE == SendATcommand("AT+CGPSSTATUS?", "3D Fix", 2000))
    {
        return pdTRUE;
    }
    else
    {
        return(SendATcommand("AT+CGPSSTATUS?", "2D Fix", 2000));
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : get_GPS
 * Description   : get_GPS GPRS for modul SIM908
 * This function use config get parameter GPS
 *
 *END**************************************************************************/
uint8_t get_GPS(GPS_INFO *vGPSinfo)
{
    char buffer_response[MAX_LENGH_STR];
    uint32_t error;
    signed char SIM_RxChar;
    if( xSemaphoreTake( xMutex, ( TickType_t ) portMAX_DELAY ) == pdTRUE )
    { 
        while(pdTRUE == xSerialGetChar(&uart2_handle, &SIM_RxChar,100));
        // First get the NMEA string
        printf("AT+CGPSINF=0\r");
        if(pdTRUE == GetResponse(buffer_response,2000))
        {
            strtok(buffer_response, ",");
            strcpy(vGPSinfo->longtitude,strtok(NULL, ",")); // Gets longitude
            strcpy(vGPSinfo->latitude,strtok(NULL, ",")); // Gets latitude
            //strcpy(altitude,strtok(NULL, ".")); // Gets altitude
            strtok(NULL, ".");
            strtok(NULL, ",");
            strcpy(vGPSinfo->date,strtok(NULL, ".")); // Gets date
            strtok(NULL, ",");
            error = pdTRUE ;
        }
        else {error = pdFAIL;}
        
        xSemaphoreGive( xMutex );
    }
    return error;
}
/*FUNCTION**********************************************************************
 *
 * Function Name : Config_GPRS_SIM908
 * Description   : Config GPRS for modul SIM908
 * This function use config gprs to sim908
 * 
AT+SAPBR=3,1,"Contype","GPRS"
AT+SAPBR=3,1,"APN","v-internet"
AT+SAPBR=1,1

 *END**************************************************************************/
void Config_GPRS_SIM908(void)
{

    /* For TCPIP GPRS*/
    //    SendATcommand("AT+CIPCSGP=1,\"v-internet\",\"\",\"\"","OK", 2000); // For Viettel Network
    // VinaPhone
    //SendATcommand("AT+CIPCSGP=1,\"3m-world\",\"mms\",\"mms\"", "OK", 2000); // For Vina Network

    /*for HTTP GPRS */
    SendATcommand("AT+SAPBR=3,1,\"Contype\",\"GPRS\"","OK",2000);
    SendATcommand("AT+SAPBR=3,1,\"APN\",\"v-internet\"","OK",2000);
    SendATcommand("AT+SAPBR=1,1","OK",2000);
    //SendATcommand("AT+SAPBR=2,1","SAPBR: 1,3,\"0.0.0.0\"",2000);
	
