haodoan/GPS_Tracking_STM32/FreeRTOS/Demo/Source/sim908.c
}


/*FUNCTION**********************************************************************
 *
 * Function Name : CheckIPaddressExist
 * Description   : Check Ip address is exist
 * This function for checking Ip address is exist
 * 
 *END**************************************************************************/
uint32_t CheckIPaddressExist()
{
    if(pdTRUE == SendATcommand("AT+SAPBR=2,1","SAPBR: 1,3,\"0.0.0.0\"",2000))
    {
        return 0;
    }
    else
    {
        return 1;
    }
}
/*FUNCTION**********************************************************************
 *
 * Function Name : Tcp_Connect
 * Description   :
 * This function
 *AT+CIPSTART="TCP","42.115.190.28","8888"
 *END**************************************************************************/
TCP_STATUS TCP_Connect(char *IP_address, char *Port,uint32_t timeout)
{
    char command[50];

    memset(command, '\0', 50);
    SendATcommand("AT+CIPSHUT", "SHUT OK", 5000);
    sprintf(command, "AT+CIPSTART=\"TCP\",\"%s\",\"%s\"", IP_address, Port);
    if (pdTRUE == SendATcommand2(command,"OK","CONNECT OK", timeout))
    {
        return TCP_CONNECT_SUCCESS;
    }
    return TCP_CONNECT_FAIL;
}
/*FUNCTION**********************************************************************
 *
 * Function Name : TCP_Send
 * Description   : `
 * This function
 *
 *END**************************************************************************/
TCP_STATUS TCP_Send(char *data_string)
{
    //char data_ctrl_z[120];
    char *data_ctrl_z;
    TCP_STATUS status;

    data_ctrl_z = pvPortMalloc(strlen(data_string) + 2);//malloc(strlen(data_string) + 2);

    if(data_ctrl_z == NULL) {return TCP_FAIL_MEM;}

    // memset(data_ctrl_z , '\0',120);
    if (pdTRUE == SendATcommand("AT+CIPSEND", ">", 10000))
    {
        sprintf(data_ctrl_z, "%s%c", data_string, 26);
        if (pdFALSE == SendATcommand(data_ctrl_z, "SEND OK", 20000))
        {
            status = TCP_SEND_TIMEOUT;
        }
        else
        {
            status = TCP_SEND_SUCCESS;
        }
    }
    else
    {
        status = TCP_SEND_FAIL;
    }
    vPortFree(data_ctrl_z);

    return status;
}

TCP_STATUS TCP_GetStatus(void)
{

    if (pdTRUE == SendATcommand("AT+CIPSTATUS", "CONNECT OK", 2000))
    {
        return TCP_CONNECT_SUCCESS;
    }
    else
    {
        return TCP_CONNECT_FAIL;
    }
}
/*FUNCTION**********************************************************************
 *
 * Function Name : TCP_Close
 * Description   :
 * This function
 *
 *END**************************************************************************/
TCP_STATUS TCP_Close(void)
{
    // Closes the socket
    if (pdTRUE == SendATcommand("AT+CIPCLOSE", "CLOSE OK", 10000))
    {
        return TCP_SUCCESS;
    }
    return TCP_FAIL;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : HTTP init
 * Description   :
 * command :
 * 
 *       AT+HTTPINIT
 *       AT+HTTPSSL=1
 *       AT+HTTPPARA="CID",1
 * This function
 AT+HTTPPARA="CONTENT","application/json"
 *END**************************************************************************/
char sSERVER[64];
HTTP_STATUS HTTP_Init(char *server)
{
    char command[256] ;
    uint8_t eRet = pdTRUE;
	
    strcpy(sSERVER , server) ;
    SendATcommand("AT+SAPBR=1,1","OK",2000);

    SendATcommand("AT+HTTPTERM","OK",1000);
		//SendATcommand("AT+SAPBR=3,1,\"Contype\",\"GPRS\"","OK",2000);
    eRet = SendATcommand("AT+HTTPINIT","OK",1000);
    if(eRet == pdTRUE)
    {
        eRet = SendATcommand("AT+HTTPPARA=\"CID\",1","OK",1000);
        if(eRet != pdTRUE)
        {
            return HTTP_INIT_FAIL;
        }
        sprintf(command, "AT+HTTPPARA=\"URL\",\"%s\"", server);
        SendATcommand(command,"OK",1000);
        SendATcommand("AT+HTTPPARA=\"CONTENT\",\"application/json\"","OK",2000);     

        return HTTP_INIT_SUCCESS;
    }

    return HTTP_INIT_FAIL;
   
}

/*FUNCTION**********************************************************************
 *
 * Function Name : HTTP Post
 * Description   :
 * command :
 * 
 *       AT+HTTPPARA="URL","http://ptsv2.com/t/Hao/post"
 *       AT+HTTPDATA=10,100000
 *       AT+HTTPPARA="CONTENT","application/json"
 *       AT+HTTPACTION=1
 * This function
 *
 *END**************************************************************************/
HTTP_STATUS HTTP_Post(char * data, uint32_t timeout)
{
    char command[50] = {0,};
    HTTP_STATUS httpStatus = HTTP_POST_SUCCESS;
    TickType_t xtime;
    
    xtime = xTaskGetTickCount();
    do
    {
    
    } while (xTaskGetTickCount() - xtime < 100 ) ;

    sprintf(command, "AT+HTTPDATA=%d,%d",strlen(data) + 1,timeout);
    if (pdTRUE == SendATcommand(command, "DOWNLOAD", 2000))
    {
        if (pdTRUE != SendATcommand(data, "OK", 20000))
        {
            httpStatus = HTTP_POST_FAIL;
        }
        else{
            if(pdTRUE != SendATcommand("AT+HTTPACTION=1" , "+HTTPACTION:1,200" ,20000))
            {
                httpStatus = HTTP_POST_NETWORF_ERROR;
            }
        }
    }
    else
    {
        httpStatus = HTTP_POST_FAIL ;
    }
    
    return httpStatus;
    
}

#define MAX_SIZE   318976
#define SECTOR_MAX_POST 800
HTTP_STATUS HTTP_POST_BIGSIZE_FromSD(uint32_t sector_num, uint32_t data_size, uint32_t timeout, void (*func)(uint32_t , char *))
{
    HTTP_STATUS httpStatus = HTTP_POST_SUCCESS;
    char *command  = pvPortMalloc(30); 
    char *gpsBuff  = pvPortMalloc(160); 
    uint32_t sizeOfAsector;
    uint32_t data_size_tmp;
    uint32_t header_size ;
    uint32_t i;
    uint32_t sector_left  = sector_num;
    uint32_t error_cnt = 0;
    //uint32_t size = 0;

    func(0, gpsBuff);
    header_size  = strlen(gpsBuff);
    func(1, gpsBuff);
    sizeOfAsector = strlen(gpsBuff);
    
    // xu ly header cho next SECTOR_MAX_POST
    for(i = 1; i < sector_num; i++)
    {
        if( i % SECTOR_MAX_POST == 1 )
        {
            if(sector_num < SECTOR_MAX_POST)
            {
               data_size_tmp =  data_size + sector_num - 2 + 4;                    
            }
            else
            {
                if(sector_left < SECTOR_MAX_POST)
                {
                    data_size_tmp = (sector_left - 1)*sizeOfAsector + header_size + sector_left - 2 + 4 ;
                }
                else
                {                    
                    data_size_tmp = SECTOR_MAX_POST *sizeOfAsector + header_size + SECTOR_MAX_POST - 1 + 4 ;
                }
            }

            sprintf(command, "AT+HTTPDATA=%d,%d",data_size_tmp ,timeout);

            if (pdTRUE != SendATcommand(command, "DOWNLOAD", 2000))
            {   
                httpStatus = HTTP_POST_FAIL ;
                break;
            }
        }

        if(httpStatus == HTTP_POST_SUCCESS)
        {
            if( i % SECTOR_MAX_POST == 1 )
            {
                func(0 , gpsBuff);                
                //size +=strlen(gpsBuff);
                printf("%s",gpsBuff );
            }
            func(i , gpsBuff);
            //size +=strlen(gpsBuff);
            if(sector_left < (SECTOR_MAX_POST + 1))
            {
                if(i < sector_num -1 )
                {
                    printf("%s,",gpsBuff );
                    //size += 1;
                }
                else
                {
                    printf("%s",gpsBuff );
                    
