haodoan/GPS_Tracking_STM32/FreeRTOS/Demo/Source/sim908.c
                }                    
            }
            else
            {
                if(i % SECTOR_MAX_POST == 0 )
                {
                    printf("%s",gpsBuff );
                }
                else
                {
                    printf("%s,",gpsBuff );
                    //size += 1;
                }                    
            }

        }

        if((i % SECTOR_MAX_POST)  == 0)
        {
            //size += 4;
            if (pdTRUE != SendATcommand("\n]}", "OK", 10000))
            {
                httpStatus = HTTP_POST_FAIL;
                break;
            }
            else
            {
                if(pdTRUE != SendATcommand("AT+HTTPACTION=1" , "+HTTPACTION:1,200" ,120000))
                {
                    if(error_cnt++ < 5)
                    {
                        i = i - SECTOR_MAX_POST ;
                    }
                    else
                    {
                        httpStatus = HTTP_POST_NETWORF_ERROR;
                        error_cnt = 0;
                        break;

                    }
                    HTTP_Init(sSERVER);
                }
                else
                {
                    sector_left -=  SECTOR_MAX_POST ;
                    error_cnt = 0;
                    vTaskDelay(2000);
                }   
            } 
            //size = 0 ;
        }

        if(i == (sector_num - 1))
        {
            if( (HTTP_POST_SUCCESS == httpStatus) && (( sector_num < SECTOR_MAX_POST ) || ( sector_left < SECTOR_MAX_POST )))
            {
                //size+=4 ;
                if (pdTRUE != SendATcommand("\n]}", "OK", 20000))
                {
                    httpStatus = HTTP_POST_FAIL;
                }
                else
                {
                    if(pdTRUE != SendATcommand("AT+HTTPACTION=1" , "+HTTPACTION:1,200" ,120000))
                    {
                        if(error_cnt++ < 5)
                        {
                             i = i + 1 - sector_left ;
                        }
                        else
                        {
                            error_cnt = 0;
                            httpStatus = HTTP_POST_NETWORF_ERROR;
                        }
                        HTTP_Init(sSERVER);
                    }
                    else
                    {
                        error_cnt = 0;
                    }
                }            
            }            
        }
    }    

    vPortFree(command);
    vPortFree(gpsBuff);

    return httpStatus;
}

HTTP_STATUS HTTP_POST_FromSD(uint32_t sector,uint32_t sector_num, uint32_t data_size, uint32_t timeout, void (*func)(uint32_t , char *))
{
	char *command  = pvPortMalloc(30); 
    char *gpsBuff  = pvPortMalloc(160); 
    uint32_t i;
    HTTP_STATUS httpStatus = HTTP_POST_SUCCESS;

    TickType_t xtime;
    /* Need to delay before post */
    xtime = xTaskGetTickCount();
    do
    {
    
    } while (xTaskGetTickCount() - xtime < 50 ) ;

    sprintf(command, "AT+HTTPDATA=%d,%d",data_size + sector_num - 2 + 4 ,timeout);
    if (pdTRUE == SendATcommand(command, "DOWNLOAD", 2000))
    {
        for(i = sector; i < sector_num; i++)
        {
            func(i , gpsBuff);
			if((i < sector_num - 1) && (i > 0))
				printf("%s,",gpsBuff );
			else
				printf("%s",gpsBuff );
        }
		//tmpsize += sector_num -2 ;
        if (pdTRUE != SendATcommand("\n]}", "OK", 20000))
        {
            httpStatus = HTTP_POST_FAIL;
        }

        if(pdTRUE != SendATcommand("AT+HTTPACTION=1" , "+HTTPACTION:1,200" ,5000))
        {
            httpStatus = HTTP_POST_NETWORF_ERROR;
        }
    }
    else
    {
        httpStatus = HTTP_POST_FAIL;
    }    
		
	vPortFree(command);
	vPortFree(gpsBuff);
    return httpStatus;
}

		
		
/*FUNCTION**********************************************************************
 *
 * Function Name : HTTP Read
 * Description   : Read data response after post
 * command :
 *       AT+HTTPREAD
 * This function
 *
 *END**************************************************************************/
HTTP_STATUS HTTP_Read(char * datOut)
{
 //    char SIM_RxChar;
 //    char *buffer = pvPortMalloc(160);
	// volatile int cnt = 0;
 //    uint32_t error = pdTRUE;
    HTTP_STATUS httpStatus = HTTP_READ_FAIL;

    TickType_t xtime;
    /* Need to delay before post */
    xtime = xTaskGetTickCount();
    do
    {
    
    } while (xTaskGetTickCount() - xtime < 1000 ) ;

 //   memset(buffer, 0 , 160);
    if (pdTRUE == SendATcommand("AT+HTTPREAD", datOut, 10000))
    {
        #if 0
    	do {
			if (pdTRUE == xSerialGetChar(&uart2_handle, (signed char*)&SIM_RxChar, 5000))
			{
				*(buffer + cnt++) = SIM_RxChar;
			}
            else
            {
                break;
            }
            if (strstr(buffer , "OK\r\n"))
            {
                httpStatus = HTTP_READ_SUCCESS;
                break;
            }
    	}while(1) ;
        
		if(strstr(buffer , "<h2>404</h2>"))
		{
			httpStatus = HTTP_NOT_FOUND;
		}
		else if(strstr(buffer , "<h2>400</h2>"))
		{
			httpStatus = HTTP_PARAM_INVALID;
		}
		else if (strstr(buffer , "\r\nOK\r\n"))
		{
			httpStatus = HTTP_READ_SUCCESS;
		}

        if(httpStatus  == HTTP_READ_SUCCESS)
        {
            //strcpy(datOut , buffer);
        }
        else
        {
        	//strcpy(datOut , "ERROR");
        }
        #endif
        
        httpStatus = HTTP_READ_SUCCESS;

    }

    //strcpy(datOut , buffer);

    //vPortFree(buffer);
    return httpStatus;


}

/*FUNCTION**********************************************************************
 *
 * Function Name : HTTP Release
 * Description   :
 * command :
 * 
 *       AT+HTTPTERM
 * This function
 *
 *END**************************************************************************/
HTTP_STATUS HTTP_Release()
{
    if (pdTRUE == SendATcommand("AT+HTTPTERM","OK",1000))
    {
        return HTTP_RELEASE_SUCCESS;
    }

    return HTTP_RELEASE_FAIL;


