haodoan/GPS_Tracking_STM32/FreeRTOS/Demo/Source/sim908.c
}
uint8_t GetAccount()
{
    char buffer_acc[160] , *ptr_buff;
    uint16_t cnt = 0;
    char SIM_RxChar;

    ptr_buff = buffer_acc;

    if (SendATcommand("AT+CUSD=1,\"*101#\"", "OK", 2000))
    {
        do {
            if (pdFALSE != xSerialGetChar(&uart2_handle, (signed char*)&SIM_RxChar, 0xffff))
            {
                *(ptr_buff++) = SIM_RxChar;
                cnt++;
            }
            if((*(ptr_buff - 2)==0xD) && (SIM_RxChar ==0xA) && (cnt > 2))
            {
                break;
            }
        }while(1) ;
    }
    *ptr_buff = '\0';
    return pdTRUE;
}
void Sim908_setup(void)
{

    xMutex = xSemaphoreCreateMutex();
    if( xMutex == NULL )
    {
        while(1);
    }
    //Sim908_power_on(); // Power up Sim908 module
    //GetIMEI(imei);
    //GetAccount();
    /*****Config Sim908 Module *****************************/
    SendATcommand("AT+CFUN=1", "OK", 2000);       // off echo
    SendATcommand("AT+CIPSHUT", "SHUT OK", 3000); // disconect gprs
    SendATcommand("AT+CSCLK=0", "OK", 2000);      // sleep mode
    SendATcommand("AT+CMGF=1", "OK", 2000);
    // GPIO_WriteLow(DTR_GPIO_PORT, (GPIO_Pin_TypeDef)DTR_GPIO_PINS); //wake up
    // Power up GPS
    //SendATcommand("AT+CGPSPWR=1", "OK", 2000); // power up gps
    // Reset GPS Cold mde
    //SendATcommand("AT+CGPSRST=1", "OK", 2000);
    /************End Config Sim908 Module *****************************/
    // delay(1000);
    SendATcommand("AT&W", "OK", 2000);
}

void Sim908_power_on(void)
{

    if (pdFALSE == SendATcommand("AT", "OK", 2000))
    { // power on pulse
        SIM908_PWRON;
        delay_ms(3000);
        SIM908_PWROFF;
        // Wake up
        // waits for an answer from the module
        SendATcommand("ATE0", "OK", 2000);
        while(pdFALSE == SendATcommand("AT", "OK", 2000));
    }
    //SendATcommand("AT", "OK", 2000);
}

void GetCmdDataSIM(char *str , char DATA_AT[5][10])
{
    char * pch;
    int i=0;
    pch = strtok (str,":");

    while (pch != NULL)
    {
        pch = strtok(NULL,",\"\r\n");
        strcpy(DATA_AT[i++],pch);
        if(i == 5) break;
    }
}

/*Get Cell ID*/
void GetCellid(GPS_INFO  *info_cellid )
{
    char buff[32];
    char DATA_AT[5][10] ;
    signed char SIM_RxChar;
    
    if( xSemaphoreTake( xMutex, ( TickType_t ) portMAX_DELAY ) == pdTRUE )
    {
        memset(DATA_AT , '\0' , sizeof(DATA_AT));
        while(pdTRUE == xSerialGetChar(&uart2_handle, &SIM_RxChar,100));        
        printf("AT+CREG?\r");
        if(GetResponse(buff, 2000))
        {
            GetCmdDataSIM(buff ,DATA_AT);
            strcpy(info_cellid->LAC,strtok (DATA_AT[2],"\""));
            strcpy(info_cellid->CELLID ,strtok (DATA_AT[3],"\""));
            strcpy(info_cellid->latitude ,"0.00");
            strcpy(info_cellid->longtitude ,"0.00");
            strcpy(info_cellid->date ,"0");
        }
        xSemaphoreGive( xMutex );
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : GetIMEI
 * Description   : GetIMEI of Sim module
 * This function use to get id IMEI of Sim module
 *
 *END**************************************************************************/
uint8_t GetIMEI(char * imei)
{
    char buff[32];
    uint32_t error;
    signed char SIM_RxChar;
    
    if( xSemaphoreTake( xMutex, ( TickType_t ) portMAX_DELAY ) == pdTRUE )
    {
        while(pdTRUE == xSerialGetChar(&uart2_handle, &SIM_RxChar,100));
        printf("AT+GSN\r");
        if(GetResponse(buff, 2000))
        {
            strncpy(imei,strstr(buff,"\r\n") + 2,15);
            *(imei+15) = 0;
            error =  pdTRUE;
        }
        else
        {
            error =  pdFALSE;
        }
        xSemaphoreGive( xMutex );        
    }
    return error;
}


void Disable_RF()
{
    if(pdTRUE !=  SendATcommand("AT+CFUN?", "+CFUN: 4", 2000))
    {
        SendATcommand("AT+CFUN=4", "OK", 2000);
    } 
}

void Enable_RF()
{
    if(pdTRUE !=  SendATcommand("AT+CFUN?", "+CFUN: 1", 2000))
    {
        SendATcommand("AT+CFUN=1", "OK", 2000);
    } 
}

/*FUNCTION**********************************************************************
 *
 * Function Name : jsonDataPost
 * Description   : covert gps data to json string
 *
 *END**************************************************************************/
void jsonDataPost(GPS_INFO gpsData,char *outBuffer)
{

    char jsonString[160];

sprintf(jsonString , \
         "{\
\"id\":%s,\
\"lat\":%s,\
\"lng\":%s,\
\"speed\":%d,\
\"fuel\":%d,\
\"bearing\":%d\
}",gpsData.IMEI,gpsData.latitude,gpsData.longtitude,0,0,0);

    sprintf(outBuffer, "%s",jsonString);

}